Покращена читабельність - Код стає більш послідовним і лінійним, без зайвої вкладеності, яка зустрічається при використанні колбеків.

Спрощена обробка помилок - за допомогою try/catch можна легко обробляти помилки в асинхронному коді, що є простішим порівняно з обробкою через .catch() для промісів.

Легкість налагодження - завдяки структурі, схожій на синхронний код, простіше відслідковувати помилки та виконання в асинхронному коді.

Послідовні операції - використання await дозволяє виконувати операції в потрібній послідовності без додаткового керування вкладеними функціями.